"""
данные для лабы
ключ "название пальца" - значение кортеж из букв,
которые соответствуют этому пальцу
первый словарь - йцукен, второй - вызов
третий - диктор, четвертый - скоропись
также добавлен счётчик на каждый палец в конце модуля
"""

keyboard_finger_qwerty = {
    "lfi5": ('ё', '1', 'й', 'ф', 'я'),
    "lfi4": ('2', 'ц', 'ы', 'ч'),
    "lfi3": ('3', 'у', 'в', 'с'),
    "lfi2": ('4', 'к', 'а', 'м', '5', 'е', 'п', 'и'),
    "lfi1": ' ',
    "rfi2": ('6', 'н', 'р', 'т', '7', 'г', 'о', 'ь'),
    "rfi3": ('8', 'ш', 'л', 'б'),
    "rfi4": ('9', 'щ', 'д', 'ю'),
    "rfi5": ('0', '-', '=', 'з', 'ж', '.', 'х', 'э', 'ъ')
}

keyboard_finger_vyzov = {
    "lfi5": ('ю', 'ё', 'в', 'ч', 'ш'),
    "lfi4": ('ы', 'и', 'х', '['),
    "lfi3": ('э', 'о', 'е', 'й'),
    "lfi2": ('Э', 'у', 'а', 'к', '(', 'ь', ',', '_'),
    "lfi1": ' ',
    "rfi2": ('=', '*', 'ё', '.', '/', '^', 'н', 'р'),
    "rfi3": (')', 'д', 'т', 'м'),
    "rfi4": ('+', 'я', 'с', 'ф'),
    "rfi5": (']', '!', 'щ', 'г', 'ж', 'ц', 'б', 'з', 'п', 'ъ')
}

keyboard_finger_qwerty_dop = {
    "lfi5": '!',
    "lfi4": '"',
    "lfi3": '№',
    "lfi2": (';', '%'),
    "rfi2": (':', '?'),
    "rfi3": '*',
    "rfi4": '(',
    "rfi5": (')', '_', '+', '/', ',')
}

keyboard_finger_vyzov_dop = {
    "lfi5": '%',
    "lfi4": '7',
    "lfi3": '5',
    "lfi2": ('3', '1'),
    "rfi2": ('9', '0'),
    "rfi3": '2',
    "rfi4": '4',
    "rfi5": ('6', '8', '#', '@')
}

keyboard_finger_dictor = {
    "lfi5": ('ё', 'у', 'ф', 'ц', '1'),
    "lfi4": ('2', 'ь', 'и', 'э'),
    "lfi3": ('3', 'я', 'е', 'х'),
    "lfi2": ('4', '5', ',', '.', 'о', 'а', 'ы', 'ю'),
    "lfi1": ' ',
    "rfi2": ('6', '7', 'з', 'в', 'л', 'н', 'б', 'м'),
    "rfi3": ('8', 'к', 'т', 'п'),
    "rfi4": ('9', 'д', 'с', 'г'),
    "rfi5": ('0', '*', '=', 'ч', 'ш', 'щ', 'р', 'й', 'ж')
}

keyboard_finger_dictor_dop = {
    "lfi5": 'ъ',
    "lfi3": '№',
    "lfi2": ('%', ':', '?', '!'),
    "rfi2": (';', '-'),
    "rfi3": '"',
    "rfi4": '(',
    "rfi5": (')', '_', '+')
}

keyboard_finger_scoropis = {
    "lfi5": ('.', 'ц', 'у', '*', 'ф'),
    "lfi4": ('ё', 'ь', 'и', 'э'),
    "lfi3": ('ъ', 'я', 'е', 'х'),
    "lfi2": ('?', '!', ',', 'о', 'а', 'ы', 'ю'),
    "lfi1": ' ',
    "rfi2": ('-', 'з', 'в', 'л', 'н', 'б', 'м'),
    "rfi3": ('`', 'к', 'т', 'п'),
    "rfi4": ('(', 'д', 'с', 'г'),
    "rfi5": (')', '_', '«', 'ч', 'ш', 'щ', '"', 'р', 'й', 'ж')
}

keyboard_finger_scoropis_dop = {
    "lfi5": ('1', '%'),
    "lfi4": '2',
    "lfi3": '3',
    "lfi2": ('4', '5', ';', ':'),
    "rfi2": ('6', '7'),
    "rfi3": '8',
    "rfi4": '9',
    "rfi5": ('0', '-', '»', '"')
}


count_penalty_qwerty = {'lfi5_1': 0, 'lfi5_2': 0, 'lfi5_3': 0,
                        'lfi4_1': 0, 'lfi4_2': 0,
                        'lfi3_1': 0, 'lfi3_2': 0,
                        'lfi2_1': 0, 'lfi2_2': 0, 'lfi2_3': 0,
                        'lfi1': 0,
                        'rfi1': 0,
                        'rfi2_1': 0, 'rfi2_2': 0, 'rfi2_3': 0,
                        'rfi3_1': 0, 'rfi3_2': 0,
                        'rfi4_1': 0, 'rfi4_2': 0,
                        'rfi5_1': 0, 'rfi5_2': 0, 'rfi5_3': 0,
                        'rfi5_4': 0, 'rfi5_5': 0,
                        'ass': 0}


penalty_table_qwerty = {
    'lfi5_1': ('я', 'й'),
    'lfi5_2': ('1'),
    'lfi5_3': ('ё'),
    'lfi4_1': ('ч', 'ц'),
    'lfi4_2': ('2'),
    'lfi3_1': ('с', 'у'),
    'lfi3_2': ('3'),
    'lfi2_1': ('м', 'к'),
    'lfi2_2': ('и', 'е', '4'),
    'lfi2_3': ('5'),
    'lfi1': (),
    'rfi1': (),
    'rfi2_1': ('ь', 'г'),
    'rfi2_2': ('т', 'н', '7'),
    'rfi2_3': ('6'),
    'rfi3_1': ('б', 'ш'),
    'rfi3_2': ('8'),
    'rfi4_1': ('ю', 'щ'),
    'rfi4_2': ('9'),
    'rfi5_1': ('.', 'з'),
    'rfi5_2': ('х', '0'),
    'rfi5_3': ('-', 'ъ'),
    'rfi5_4': ('='),
    'rfi5_5': ('\\'),
    'ass': ('ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э')
}
penalty_table_qwerty_dop = {
    "lfi5_2": '!',
    "lfi4_2": '"',
    "lfi3_2": '№',
    "lfi2_2": (';'),
    "lfi2_3": ('%'),
    "rfi2_2": ('?'),
    "rfi2_3": (':'),
    "rfi3_2": '*',
    "rfi4_2": '(',
    "rfi5_2": (')'),
    "rfi5_3": ('_'),
    "rfi5_4": ('+'),
    "rfi5_5": ('/', ',')
}


count_penalty_vyzov = {'lfi5_1': 0, 'lfi5_2': 0,
                       'lfi4_1': 0, 'lfi4_2': 0,
                       'lfi3_1': 0, 'lfi3_2': 0,
                       'lfi2_1': 0, 'lfi2_2': 0, 'lfi2_3': 0,
                       'lfi1': 0,
                       'rfi1': 0,
                       'rfi2_1': 0, 'rfi2_2': 0, 'rfi2_3': 0,
                       'rfi3_1': 0, 'rfi3_2': 0,
                       'rfi4_1': 0, 'rfi4_2': 0,
                       'rfi5_1': 0, 'rfi5_2': 0, 'rfi5_3': 0, 'rfi5_4': 0,
                       'ass': 0}


penalty_table_vyzov = {
    'lfi5_1': ('ш', 'б'),
    'lfi5_2': ('ё'),
    'lfi4_1': ('х', 'ы'),
    'lfi4_2': ('['),
    'lfi3_1': ('й', 'о'),
    'lfi3_2': ('{'),
    'lfi2_1': ('к', 'у'),
    'lfi2_2': ('}', '-', 'ь'),
    'lfi2_3': ('('),
    'lfi1': (),
    'rfi1': (),
    'rfi2_1': ('р', '^'),
    'rfi2_2': ('ё', '*', '/'),
    'rfi2_3': ('='),
    'rfi3_1': ('м', 'д'),
    'rfi3_2': (')'),
    'rfi4_1': ('ф', 'я'),
    'rfi4_2': ('+'),
    'rfi5_1': ('п', 'г'),
    'rfi5_2': ('ж', ']'),
    'rfi5_3': ('!', 'ц'),
    'rfi5_4': ('щ', 'ъ'),
    'ass': ('ч', 'и', 'е', 'а', ',', '.', 'н', 'т', 'с', 'в', 'з')
}

penalty_table_vyzov_dop = {
    "lfi5_2": '%',
    "lfi4_2": '7',
    "lfi3_2": '5',
    "lfi2_2": ('3'),
    "lfi2_3": ('1'),
    "rfi2_2": ('0'),
    "rfi2_3": ('9'),
    "rfi3_2": '2',
    "rfi4_2": '4',
    "rfi5_2": ('6'),
    "rfi5_3": ('8', '@'),
    "rfi5_4": ('#', '|')
}


vyzov_finger_count = {'lfi5': 0, 'lfi4': 0, 'lfi3': 0, 'lfi2': 0,
                      'lfi1': 0, 'rfi1': 0, 'rfi2': 0,
                      'rfi3': 0, 'rfi4': 0, 'rfi5': 0}
qwerty_finger_count = {'lfi5': 0, 'lfi4': 0, 'lfi3': 0, 'lfi2': 0,
                       'lfi1': 0, 'rfi1': 0, 'rfi2': 0,
                       'rfi3': 0, 'rfi4': 0, 'rfi5': 0}
dictor_finger_count = {'lfi5': 0, 'lfi4': 0, 'lfi3': 0, 'lfi2': 0,
                       'lfi1': 0, 'rfi1': 0, 'rfi2': 0,
                       'rfi3': 0, 'rfi4': 0, 'rfi5': 0}
scoropis_finger_count = {'lfi5': 0, 'lfi4': 0, 'lfi3': 0, 'lfi2': 0,
                         'lfi1': 0, 'rfi1': 0, 'rfi2': 0,
                         'rfi3': 0, 'rfi4': 0, 'rfi5': 0}
