"""
данные для лабы
ключ "название пальца" - значение кортеж из букв,
которые соответствуют этому пальцу
первый словарь - йцукен, второй словарь - вызов
также добавлен счётчик на каждый палец в конце модуля
"""

keyboard_finger_qwerty = {
    "lfi5": ('ё', '1', 'й', 'ф', 'я'),
    "lfi4": ('2', 'ц', 'ы', 'ч'),
    "lfi3": ('3', 'у', 'в', 'с'),
    "lfi2": ('4', 'к', 'а', 'м', '5', 'е', 'п', 'и'),
    "lfi1": ' ',
    "rfi2": ('6', 'н', 'р', 'т', '7', 'г', 'о', 'ь'),
    "rfi3": ('8', 'ш', 'л', 'б'),
    "rfi4": ('9', 'щ', 'д', 'ю'),
    "rfi5": ('0', '-', '=', 'з', 'ж', '.', 'х', 'э', 'ъ')
}

keyboard_finger_vyzov = {
    "lfi5": ('ю', 'ё', 'в', 'ч', 'ш'),
    "lfi4": ('ы', 'и', 'х', '['),
    "lfi3": ('э', 'о', 'е', 'й'),
    "lfi2": ('Э', 'у', 'а', 'к', '(', 'ь', ',', '_'),
    "lfi1": ' ',
    "rfi2": ('=', '*', 'ё', '.', '/', '^', 'н', 'р'),
    "rfi3": (')', 'д', 'т', 'м'),
    "rfi4": ('+', 'я', 'с', 'ф'),
    "rfi5": (']', '!', 'щ', 'г', 'ж', 'ц', 'б', 'з', 'п', 'ъ')
}

keyboard_finger_qwerty_dop = {
    "lfi5": '!',
    "lfi4": '"',
    "lfi3": '№',
    "lfi2": (';', '%'),
    "rfi2": (':', '?'),
    "rfi3": '*',
    "rfi4": '(',
    "rfi5": (')', '_', '+', '/', ',')
}

keyboard_finger_vyzov_dop = {
    "lfi5": '%',
    "lfi4": '7',
    "lfi3": '5',
    "lfi2": ('3', '1'),
    "rfi2": ('9', '0'),
    "rfi3": '2',
    "rfi4": '4',
    "rfi5": ('6', '8', '#', '@')
}


vyzov_finger_count = {'lfi5': 0, 'lfi4': 0, 'lfi3': 0, 'lfi2': 0, 'lfi1': 0, 'rfi2': 0, 'rfi3': 0, 'rfi4': 0, 'rfi5': 0}
qwerty_finger_count = {'lfi5': 0, 'lfi4': 0, 'lfi3': 0, 'lfi2': 0, 'lfi1': 0, 'rfi2': 0, 'rfi3': 0, 'rfi4': 0, 'rfi5': 0}
